GPI/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
	def index
		@gg = Account.all

INSERT INTO "accounts" ("nombre", "contrasena", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "nombre"], ["contrasena", "contrasena"], ["tipo", "tipo"], ["created_at", "2018-05-12 21:06:15.532630"], ["updated_at", "2018-05-12 21:06:15.532630"]]
---
	def create
		#render plain: params[:account].inspect

		@account = Account.create(account_params)

SELECT  "accounts".* FROM "accounts" ORDER BY "accounts"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
	def show
		@account = Account.all

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def edit
		@account = Account.find(params[:id])

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "accounts" SET "nombre" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["nombre", "nombrecc"], ["updated_at", "2018-06-05 17:58:22.558052"], ["id", 8]]
---
	def update
		@account = Account.find(params[:id])
		@account.update account_params

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 3]]
---
	def destroy
		redirect_to action: "index"
		@account = Account.find(params[:id])
		@account.destroy