GPI/app/controllers/compras_controller.rb

	def index
		@gg = Compra.all
---
SELECT "compras".* FROM "compras"

	def create
		@pedido = Compra.create(compra_params)
---
INSERT INTO "compras" ("producto", "provedor", "precio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["producto", "clavos"], ["provedor", "clavos inc"], ["precio", 20.0], ["created_at", "2018-08-05 22:45:40.323529"], ["updated_at", "2018-08-05 22:45:40.323529"]]

	def destroy
		redirect_to action: "index"
		@pedido = Compra.find(params[:id])
		@pedido.destroy
---
SELECT  "compras".* FROM "compras" WHERE "compras"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "compras" WHERE "compras"."id" = ?  [["id", 1]]