GPI/app/controllers/pedidos_controller.rb

	def index
		@gg = Pedido.where(["solicitante = :u", { u: current_user.email }])
---
SELECT "pedidos".* FROM "pedidos" WHERE (solicitante = 'p@gmail.com')

	def indexAdmin
		@gg = Pedido.all
---
SELECT "pedidos".* FROM "pedidos"

	def create
		@pedido = Pedido.create(pedido_params)
		@pedido.codigo = "hola"
		@pedido.solicitante = current_user.email
		@pedido.estado = "solicitado"

		if @pedido.save
---
INSERT INTO "pedidos" ("material", "cantidad", "detalles", "created_at", "updated_at", "trabajo") VALUES (?, ?, ?, ?, ?, ?)  [["material", "dada"], ["cantidad", 2.0], ["detalles", "erverrve"], ["created_at", "2018-08-05 17:28:03.507134"], ["updated_at", "2018-08-05 17:28:03.507134"], ["trabajo", "eferfef"]]
UPDATE "pedidos" SET "codigo" = ?, "solicitante" = ?, "estado" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["codigo", "hola"], ["solicitante", "yo"], ["estado", "solicitado"], ["updated_at", "2018-07-22 20:19:24.856224"], ["id", 6]]

	def edit
		@pedido = Pedido.find(params[:id])
---
SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

	def update
		@pedido = Pedido.find(params[:id])
		@pedido.update pedido_params
---
SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "pedidos" SET "estado" = ?, "updated_at" = ? WHERE "pedidos"."id" = ?  [["estado", "naa"], ["updated_at", "2018-08-01 20:13:48.892440"], ["id", 22]]

	def destroy
		redirect_to action: "index"
		@pedido = Pedido.find(params[:id])
		@pedido.destroy
---
SELECT  "pedidos".* FROM "pedidos" WHERE "pedidos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "pedidos" WHERE "pedidos"."id" = ?  [["id", 2]]